Revit 2024 API
AnalyticalTransferSwitchData Class
 Represents the data and parameters of electrical analytical transfer switch.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class AnalyticalTransferSwitchData : AnalyticalDistributionNodePropertyData
Visual Basic
Public Class AnalyticalTransferSwitchData _
	Inherits AnalyticalDistributionNodePropertyData
Visual C++
public ref class AnalyticalTransferSwitchData : public AnalyticalDistributionNodePropertyData
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
 Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData
See Also
AnalyticalTransferSwitchData Members
Autodesk.Revit.DB.Electrical Namespace